{
  "basics": {
    "name": "Liav Yona",
    "label": "Software Engineer",
    "image": "",
    "email": "liavyona09@gmail.com",
    "phone": "(+972) 52-299-4528",
    "url": "https://liavyona.github.io",
    "summary": "A German-born theoretical physicist, widely ranked among the greatest and most influential scientists of all time",
    "location": {
      "address": "Rienes 29 Apt. 3",
      "postalCode": "6346115",
      "city": "Tel Aviv",
      "countryCode": "IL",
      "region": "Central"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "LiavYona",
        "url": "https://x.com/LiavYona"
      }
    ]
  },
  "work": [
    {
      "name": "Raven",
      "position": "Founding Engineer",
      "url": "https://raven.io/",
      "startDate": "2024-03-27",
      "summary": "Working on an ADR solution that helps security teams discover their entire code vulnerability footprint, identify executed parts, and prevent exploitation in real-time using a policy engine across Multi-Cloud and Kubernetes clusters. Driving the journey from idea to product by shaping system design, event-driven architecture, scalable infrastructure, microservices development, and application code implementation.",
      "highlights": ["Cyber"]
    }, {
      "name": "Firefly",
      "position": "Engineering Team Lead | Founding Engineer",
      "url": "https://firefly.ai/",
      "startDate": "2021-04-25",
      "endDate": "2024-03-16",
      "summary": "Working on a cloud Asset Management solution enabling DevOps, SRE, and Cloud Platform teams to rediscover their cloud footprint, identify codified vs. unmanaged parts, detect drifts to prevent failures, classify assets with Policy-as-Code, and manage a unified inventory across Multi-Cloud and Kubernetes clusters. Driving the journey from idea to product by shaping system design, event-driven architecture, scalable infrastructure, microservices development, and application code implementation. Leading and fostering successful process overhauls, optimizing development and recruitment processes, and ensuring effective sprint designs for a team of up to 12 developers. Managing daily product communication, liaising with customers, and enhancing product impact and customer satisfaction. Overseeing large-scale production systems and contributing to the company's growth and success.",
      "highlights": ["IaC"]
    },
    {
      "name": "CyberArk",
      "position": "Software Engineer",
      "url": "https://cyberark.com/",
      "startDate": "2020-06-14",
      "endDate": "2021-04-24",
      "summary": "Working on an OSS application, Conjur, that manages user and machine identities and controls access to target resources using RBAC. Driving the design and development of a microservices environment from scratch to manage tenant application environments on Kubernetes clusters for SaaS deployments.",
      "highlights": ["Cyber"]
    },
    {
      "name": "Unit 8200",
      "position": "Engineering Team Lead | Software Engineer",
      "url": "https://www.idf.il/",
      "startDate": "2015-10-14",
      "endDate": "2020-06-13",
      "summary": "Designing and developing a smart VPN application that implements router functionalities for operational needs. Working extensively with networking tools and protocols, including TCP, UDP, ICMP, MPTCP, SSH, OpenVPN, HTTP, HTTPS, SSL, Linux network namespaces, IPVSADM, iptables, and more, across both user and kernel space. Leading an R&D team. Driving a substantial increase in daily active users by enhancing the application’s capabilities to meet client needs, including support for additional network protocols. Overhauling team development processes and leading sprint designs. Designing and developing a Python library to automate the usage of Android mobile devices for operational needs across multiple vendors. Building and designing native Android libraries to extend and provide privileged capabilities. Researching Android internals and security issues, including Defex, RKP, factory reset, and more, to understand attack vectors.",
      "highlights": ["Cyber"]
    }
  ],
  "education": [
    {
      "institution": "De-Shalit Educational Campus",
      "location": "Rehovot, Israel",
      "url": "https://deshalit.co.il/de-shalit-educational-campus-eng/",
      "area": "Mofet Excellence Program",
      "studyType": "High School",
      "startDate": "2009-09-01",
      "endDate": "2015-06-20",
      "score": "100",
      "courses": ["Computer Science", "Physics", "Mathematics"]
    }
  ],
  "certificates": [
    {
      "name": "Speaker: KubeCon and CloudNativeCon Europe 2023",
      "date": "2023-05-03",
      "issuer": "Linux Foundation",
      "url": "https://www.credly.com/badges/f00447fb-7b9e-4708-bf92-8f24da05f0af/linked_in_profile",
      "icon": "fa-solid fa-location-dot"
    },
    {
      "name": "Certified Kubernetes Administrator",
      "date": "2023-05-01",
      "issuer": "Linux Foundation",
      "url": "https://ti-user-certificates.s3.amazonaws.com/e0df7fbf-a057-42af-8a1f-590912be5460/eca02e04-d236-4571-8e07-0afd8d434208-liav-yona-c3f58819-2f0b-4139-9c47-1cec8d49a368-certificate.pdf",
      "icon": "fa-solid fa-location-dot"
    }
  ],
  "publications": [
    {
      "name": "The Great Lambda Migration to Kubernetes Jobs—A Journey in Three Parts",
      "publisher": "InfoQ",
      "releaseDate": "2023-03-15",
      "url": "https://www.infoq.com/articles/lambda-migration-k8s-jobs/",
      "summary": "As a SaaS operation built to handle hundreds of concurrent executions and multiple interfaces like S3, API Gateway requests, lambda functions, SQS & SNS messages, we got started with an AWS lambda functions based architecture, as it was fast, scalable, and suitable for multiple concurrent runners, as the backbone for the main flow of our system. Over time as the lambda functions jobs became more complex, and each operation took more time to complete, to prevent timeouts, which can lead to inconsistencies in data flow, we decided to explore alternative technologies that could withstand the growing load. Once we identified the core capabilities we required from our system, including high visibility & observability, with consistent SLAs, we decided to attempt to convert the current function code-base into K8s jobs as an infinite runtime process. K8s provides us with full visibility of our jobs' status, tenant separation (separate namespaces), secrets & volume sharing with one operator to rule them all. This blog will walk through how we built a solution that ended up being more secure, cost-effective and resilient demonstrating greater stability at scale, with better tenant isolation, improved task prioritization, and storage integrations."
    },
    {
      "name": "Building with Open Policy Agent (OPA) for Better Policy as Code",
      "publisher": "DevZone",
      "releaseDate": "2022-01-15",
      "url": "https://dzone.com/articles/building-with-open-policy-agent-opa-for-better-pol",
      "summary": "Introduction to OPA or Open Policy Agent tool. In this blog we will examine the tool and reveal how we leveraged it as a generic interface to work with any dataset"
    },
    {
      "name": "Create a Global COVID-19 Vaccinations Progress GraphDB – Introduction to ArangoDB",
      "publisher": "Medium",
      "releaseDate": "2021-11-19",
      "url": "https://liavyona09.medium.com/create-a-global-covid-19-vaccinations-progress-graphdb-introduction-to-arangodb-97702de53076",
      "summary": "In my last blog, we can learn how to describe the COVID vaccination status progress for each country in an ArangoDB graph. We also use AWS Lambda to gather the required data from Our World in Data and save it in a graph database."
    },
    {
      "name": "SQL Triggers with AWS Lambda — Take Your DB to the Next Level",
      "publisher": "Medium",
      "releaseDate": "2021-8-1",
      "url": "https://link.medium.com/cJ2itmq4mib",
      "summary": "SQL triggers can be a powerful yet a bit complicated and limited tool. In my blog, I would like to share the next generation of these trigger using AWS Lambda."
    },
    {
      "name": "Spice up Your Kubernetes Environment with AWS Lambda",
      "publisher": "Medium",
      "releaseDate": "2021-05-08",
      "url": "https://liavyona09.medium.com/spice-up-your-kubernetes-environment-with-aws-lambda-a07d81347607",
      "summary": "Kubernetes environments are very powerful yet quite limited and messy when it comes to integration with cloud products. Lambda, in opposition, by design integrates well with such products. In my latest blog, I want to share with you a simple yet powerful, effective and secure way we can integrate Lambda with existing Kubernetes environment without any codes changes at all."
    }
  ],
  "skills": [
    {
      "name": "Computer Science",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Software Engineering",
        "Software Architecture",
        "Team Management",
        "Cloud Computing",
        "DevOps",
        "Cybersecurity"
      ]
    }
  ],
  "languages": [
    {
      "language": "Hebrew",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    },
    {
      "language": "Spanish",
      "fluency": "Intermediate",
      "icon": ""
    }
  ],
  "interests": [
    {
      "name": "Software Engineering",
      "icon": "fa-solid fa-tag",
      "keywords": [
        "Cloud Computing",
        "Clean Code",
        "Software Architecture",
        "Team Management"
      ]
    },
    {
      "name": "Sports",
      "icon": "fa-solid fa-tag",
      "keywords": [
        "Football",
        "Running",
        "Gymnastics",
        "Weightlifting"
      ]
    }
  ],
  "references": [
    {
      "name": "Shahar Glazner - Engineering Team Lead at Unit 8200",
      "icon": "fa-solid fa-thumbtack",
      "reference": "I had the privilege of managing Liav for over two years, and I can confidently say he is one of the most talented individuals I've worked with—an absolute 10/10. Liav is the kind of teammate you'd want on your side any day of the week. He was a key player in the team, consistently going above and beyond in his contributions. From writing high-quality code to deploying it in production and ensuring everything ran smoothly, Liav demonstrated exceptional skill, ownership, and reliability at every step. It’s rare to find someone with his combination of technical expertise, work ethic, and dedication. Liav is, without a doubt, top talent and a true asset to any team."
    },
    {
      "name": "Avi Kavas - R&D Group Manager at CyberArk",
      "icon": "fa-solid fa-thumbtack",
      "reference": "I had the pleasure of working with Liav at CyberArk. Liav is a versatile developer who can dive into any new technology and complex architecture thoroughly and very quickly. Liav is one of the most productive developers I worked with. He can deliver significant new features and product enhancements at an amazing speed. Liav is passionate not only about his tasks but also about the success of his team. He constantly drives improvements in many areas including pushing new technologies, new architectures or even improving inefficiencies in the development process. Liav is a team player and loves assisting anyone who needs his help."
    },
    {
      "name": "Eran Bibi - CPO at Firefly",
      "icon": "fa-solid fa-thumbtack",
      "reference": "It's with great enthusiasm that I recommend Liav for any future opportunities that come his way. Having had the privilege of working alongside Liav from the early days of Firefly, I witnessed firsthand his remarkable contribution not just as a founding engineer but also as an invaluable team lead. Liav possesses a rare combination of technical expertise and leadership qualities that catalyzed our team's success. His technical acumen played a pivotal role in developing and implementing critical projects, setting the foundation for Firefly's technology stack. Liav's solutions were innovative and reliably scalable, reflecting his forward-thinking approach to problem-solving. Liav's leadership went beyond his technical contributions. He demonstrated a profound ability to manage and inspire his team, creating an environment of collaboration, creativity, and growth. He also supervised personnel both locally and overseas. Under his guidance, the team achieved remarkable milestones and delivered projects with efficiency and excellence."
    }
  ],
  "projects": [
    {
      "name": "AIaC",
      "summary": "Artificial Intelligence Infrastructure-as-Code Generator.",
      "highlights": ["AI", "IaC", "Generative AI"],
      "startDate": "2022-12-01",
      "endDate": "2023-03-16",
      "url": "https://aiac.dev"
    }
  ]
}
